# WallSweepInfo Constructor (WallSweepType, Boolean)

---
C#Visual BasicVisual C++
Revit 2024 API
---
WallSweepInfo Constructor (WallSweepType, Boolean)
WallSweepInfo Class See Also
---
Constructs a new WallSweepInfo instance.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public WallSweepInfo(
	WallSweepType type,
	bool vertical
)
```

Visual Basic
---
```text
Public Sub New ( _
	type As WallSweepType, _
	vertical As Boolean _
)
```

Visual C++
---
```text
public:
WallSweepInfo(
	WallSweepType type,
	bool vertical
)
```

# ### Parameters
type
    Type: Autodesk.Revit.DB..::..WallSweepType The type of the WallSweepInfo instance.
vertical
    Type: System..::..Boolean True to construct a vertical wall sweep, false otherwise.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | A value passed for an enumeration argument is not a member of that enumeration |

# See Also
WallSweepInfo Class
WallSweepInfo Overload
Autodesk.Revit.DB Namespace